If true style has vector settings.
  Namespace:   Autodesk.Revit.DB.Analysis
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public bool HasVectorSettings()
  Visual Basic
Public Function HasVectorSettings As Boolean
  Visual C++
public:
bool HasVectorSettings()
 See Also
  AnalysisDisplayStyle Class
  Autodesk.Revit.DB.Analysis Namespace